Revit 2026 API

# FamilyTypeAsString Method

---

Provides access to the string contents of the given family parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string AsString(
	FamilyParameter familyParameter
)
```
```vb
Public Function AsString (
	familyParameter As FamilyParameter
) As String
```
```cpp
public:
String^ AsString(
	FamilyParameter^ familyParameter
)
```
```fsharp
member AsString :
        familyParameter : FamilyParameter -> string
```

#### Parameters

familyParameter FamilyParameter

#### Return Value

StringThe string contained in the parameter. Returns  if the storage type of the input argument is not string type or this parameter has no value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| ArgumentException | Thrown if the input argument-"familyParameter"-is invalid, |

#### Reference

FamilyType Class

Autodesk.Revit.DB Namespace